In [71]:
import pandas as pd
df = pd.read_csv("C:/Users/abhip/OneDrive/Desktop/Learn-Pandas-master/data/sample_data.csv", index_col = 0)

In [26]:
#Checking the dataframe:
df

          state  color favourite food  age  height  score  count
Jane         NY   blue          Steak   30     165    4.6     10
Niko         TX  green           Lamb    2      70    8.3      4
Aaron        FL    red          Mango   12     120    9.0      3
Penelope     AL  white          Apple    4      80    3.3     12
Dean         AK   gray         Cheese   32     180    1.8      8
Christina    TX  black          Melon   33     172    9.5     99
Cornelia     TX    red          Beans   69     150    2.2     44

In [27]:
#Selecting a single column from a dataframe:
df['color']

Jane          blue
Niko         green
Aaron          red
Penelope     white
Dean          gray
Christina    black
Cornelia       red
Name: color, dtype: object

In [28]:
# Another way of selecting a column would be with dot notation:
df.color

Jane          blue
Niko         green
Aaron          red
Penelope     white
Dean          gray
Christina    black
Cornelia       red
Name: color, dtype: object

- Problems with dot notation:
   1. When there are spaces in the column name
   2. When the column name is the same as a DataFrame method
   3. When the column name is a variable

In [29]:
# Problem 1. Python treats spaces to separate names and operators and hence will not treat a column name with space as correct syntax
df. favourite food

SyntaxError: invalid syntax (<ipython-input-29-2cce70045287>, line 2)

In [30]:
#We can only use square brackets to achieve the above
df['favourite food']

Jane          Steak
Niko           Lamb
Aaron         Mango
Penelope      Apple
Dean         Cheese
Christina     Melon
Cornelia      Beans
Name: favourite food, dtype: object

In [31]:
#Problem 2. When a column name and a DataFrame method collide, Pandas will always reference the method and not the column name
df.count

<bound method DataFrame.count of           state  color favourite food  age  height  score  count
Jane         NY   blue          Steak   30     165    4.6     10
Niko         TX  green           Lamb    2      70    8.3      4
Aaron        FL    red          Mango   12     120    9.0      3
Penelope     AL  white          Apple    4      80    3.3     12
Dean         AK   gray         Cheese   32     180    1.8      8
Christina    TX  black          Melon   33     172    9.5     99
Cornelia     TX    red          Beans   69     150    2.2     44>

In [32]:
df['count']

Jane         10
Niko          4
Aaron         3
Penelope     12
Dean          8
Christina    99
Cornelia     44
Name: count, dtype: int64

In [36]:
#Problem 3: When column name is a variable:
col = 'height'
df[col]

Jane         165
Niko          70
Aaron        120
Penelope      80
Dean         180
Christina    172
Cornelia     150
Name: height, dtype: int64

In [37]:
#This will produce an error:
df.col

AttributeError: 'DataFrame' object has no attribute 'col'

- Use brackets over dot notation as dot notation does not provide any superiror functionality

- Use loc for indexing using the labels
- Use iloc for indexing using integers
- Avoid using the ambiguous ix

In [46]:
df.loc[:,['height','count']]

           height  count
Jane          165     10
Niko           70      4
Aaron         120      3
Penelope       80     12
Dean          180      8
Christina     172     99
Cornelia      150     44

In [43]:
df.iloc[:,4]

Jane         165
Niko          70
Aaron        120
Penelope      80
Dean         180
Christina    172
Cornelia     150
Name: height, dtype: int64

- There are 2 additional indexers named at & iat that can select a single cell of a dataframe
- For performance issues let us compare numy, iat and iloc

In [47]:
#Let us create an array with 100k rows and 5 columns:
import numpy as np
a = np.random.rand(10 ** 5, 5)
df1 = pd.DataFrame(a)

In [48]:
a.shape

(100000, 5)

In [49]:
row = 50000
col = 3

In [50]:
%timeit df1.iloc[row, col]

The slowest run took 98.98 times longer than the fastest. This could mean that an intermediate result is being cached.
100000 loops, best of 3: 9.21 µs per loop

In [51]:
%timeit df1.iat[row, col]

The slowest run took 8.49 times longer than the fastest. This could mean that an intermediate result is being cached.
100000 loops, best of 3: 6.17 µs per loop

In [52]:
%timeit a[row, col]

The slowest run took 24.35 times longer than the fastest. This could mean that an intermediate result is being cached.
10000000 loops, best of 3: 140 ns per loop

- NUmpy is a clear winner here. So, if we have an application that has performace issues then using Numpy instead of Pandas is beenficial

- Method Duplication - There are multiple methods in Pandas that do the exact same thing and thus we term them under method duplication

In [60]:
#read_csv vs read_table. They both do the same thing except the fact that read_csv uses comma as a delimeter and read_table uses tab as a delimeter
college = pd.read_csv("C:/Users/abhip/OneDrive/Desktop/Learn-Pandas-master/data/college.csv")

In [61]:
#Checking the data in the file:
college.head(3)

,INSTNM,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
0,Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
1,University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
2,Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,...,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370

In [63]:
college2 = pd.read_table("C:/Users/abhip/OneDrive/Desktop/Learn-Pandas-master/data/college.csv", delimiter = ',')

In [65]:
#Checking if the 2 files are equal to each other:
college.equals(college2)

True

 - One should use read_csv for the simplicity purpose

In [75]:
# ISNULL to calculate null values
#college_isna = college.isna()
college_isnull = college.isnull()
#college_isna.equals(college_isnull)
college_isnull.head(3)

,INSTNM,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
0,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,True,True,False,...,False,False,False,False,False,False,False,False,False,False

In [78]:
#Using operators:
ugds = college['UGDS']
ugds_operator = ugds + 100
ugds_methods = ugds.add(100)
ugds_operator.equals(ugds_methods)

True

In [80]:
#Using dropna:
college_idx = college.set_index('INSTNM')
sats = college_idx[['SATMTMID','SATVRMID']].dropna()
sats.head(5)

                                     SATMTMID  SATVRMID
INSTNM
Alabama A & M University                420.0     424.0
University of Alabama at Birmingham     565.0     570.0
University of Alabama in Huntsville     590.0     595.0
Alabama State University                430.0     425.0
The University of Alabama               565.0     555.0

In [81]:
mean = sats.mean()
std = sats.std()

In [82]:
zscore_operator = (sats - mean)/std
zscore_operator.head(5)

                                     SATMTMID  SATVRMID
INSTNM
Alabama A & M University            -1.506666 -1.440062
University of Alabama at Birmingham  0.462235  0.688496
University of Alabama in Huntsville  0.801701  1.052975
Alabama State University            -1.370879 -1.425482
The University of Alabama            0.462235  0.469809

In [83]:
zscore_methods = sats.sub(mean).div(std)
zscore_operator.equals(zscore_methods)

True

In [85]:
#More implementation of methods:
college_race = college_idx.loc[:,'UGDS_WHITE' : 'UGDS_UNKN']
college_race.head(3)

,UGDS_WHITE,UGDS_BLACK,UGDS_HISP,UGDS_ASIAN,UGDS_AIAN,UGDS_NHPI,UGDS_2MOR,UGDS_NRA,UGDS_UNKN
INSTNM,,,,,,,,,
Alabama A & M University,0.0333,0.9353,0.0055,0.0019,0.0024,0.0019,0.0000,0.0059,0.0138
University of Alabama at Birmingham,0.5922,0.2600,0.0283,0.0518,0.0022,0.0007,0.0368,0.0179,0.0100
Amridge University,0.2990,0.4192,0.0069,0.0034,0.0000,0.0000,0.0000,0.0000,0.2715

In [86]:
# We need to get student population by race per school:
ugds = college_idx['UGDS']
ugds.head(3)

INSTNM
Alabama A & M University                4206.0
University of Alabama at Birmingham    11383.0
Amridge University                       291.0
Name: UGDS, dtype: float64

In [89]:
df_1 = college_race.mul(ugds, axis='index').round(0)
df_1.head(3)

,UGDS_WHITE,UGDS_BLACK,UGDS_HISP,UGDS_ASIAN,UGDS_AIAN,UGDS_NHPI,UGDS_2MOR,UGDS_NRA,UGDS_UNKN
INSTNM,,,,,,,,,
Alabama A & M University,140.0,3934.0,23.0,8.0,10.0,8.0,0.0,25.0,58.0
University of Alabama at Birmingham,6741.0,2960.0,322.0,590.0,25.0,8.0,419.0,204.0,114.0
Amridge University,87.0,122.0,2.0,1.0,0.0,0.0,0.0,0.0,79.0

In [92]:
#Verifying more built in functions:
ugds = college['UGDS'].dropna()
ugds.head(3)

0     4206.0
1    11383.0
2      291.0
Name: UGDS, dtype: float64

In [93]:
sum(ugds)

16200904.0

In [94]:
ugds.sum()

16200904.0

In [95]:
max(ugds)

151558.0

In [96]:
ugds.max()

151558.0

In [97]:
min(ugds)

0.0

In [98]:
ugds.min()

0.0

In [99]:
abs(ugds).head()

0     4206.0
1    11383.0
2      291.0
3     5451.0
4     4811.0
Name: UGDS, dtype: float64

In [100]:
ugds.abs().head()

0     4206.0
1    11383.0
2      291.0
3     5451.0
4     4811.0
Name: UGDS, dtype: float64

#Standardization, Group by, Aggregation:
-Three componenets while aggregating the data.
. Grouping column: Unique values from independent groups
. Aggregating column: Column whose values will get aggregated. Usually numeric
. Aggregating Function: How the values will get aggregated (sum, min, max etc)

#Standardization, Group by, Aggregation: -Three componenets while aggregating the data.
- Grouping column: Unique values from independent groups  
- Aggregating column: Column whose values will get aggregated. Usually numeric
- Aggregating Function: How the values will get aggregated (sum, min, max etc)

#Grouping syntax:
df.groupby('grouping column').agg({'aggregating column' : 'aggregating function'})

In [101]:
#Let us use ggrouping to find SAT score per state:

college[['STABBR','SATMTMID', 'SATVRMID','UGDS']].head(4)

  STABBR  SATMTMID  SATVRMID     UGDS
0     AL     420.0     424.0   4206.0
1     AL     565.0     570.0  11383.0
2     AL       NaN       NaN    291.0
3     AL     590.0     595.0   5451.0

In [104]:
college.groupby('STABBR').agg({'SATMTMID' : 'max'}).head(4)

        SATMTMID
STABBR
AK         503.0
AL         590.0
AR         600.0
AS           NaN

In [105]:
college.groupby('STABBR').agg({'SATMTMID' : ['max','min'],
                              'SATVRMID' : ['max','min'],
                              'UGDS' : 'mean'}).head(4)

       SATMTMID                UGDS SATVRMID
            max    min         mean      max    min
STABBR
AK        503.0  503.0  2493.200000    555.0  555.0
AL        590.0  400.0  2789.865169    595.0  420.0
AR        600.0  427.0  1644.146341    600.0  410.0
AS          NaN    NaN  1276.000000      NaN    NaN

In [108]:
#Handling Multiindex:
agg_dict = {'SATMTMID' : ['max','min'],
            'SATVRMID' : ['max','min'],
            'UGDS' : 'mean'}
#Grouping by state and religion affiliation:
df = college.groupby(['STABBR', 'RELAFFIL']).agg(agg_dict)
df.head(6)

                SATMTMID                UGDS SATVRMID
                     max    min         mean      max    min
STABBR RELAFFIL
AK     0             NaN    NaN  3508.857143      NaN    NaN
       1           503.0  503.0   123.333333    555.0  555.0
AL     0           590.0  420.0  3248.774648    595.0  424.0
       1           560.0  400.0   979.722222    565.0  420.0
AR     0           565.0  427.0  1793.691176    555.0  410.0
       1           600.0  495.0   917.785714    600.0  425.0

In [111]:
#Group by , pivot & crosstab:

emp  = df = pd.read_csv("C:/Users/abhip/OneDrive/Desktop/Learn-Pandas-master/data/employee.csv")

In [112]:
df.head(5)

,POSITION_TITLE,DEPARTMENT,BASE_SALARY,RACE,EMPLOYMENT_TYPE,GENDER,HIRE_DATE,JOB_DATE
0,ASSISTANT DIRECTOR (EX LVL),Municipal Courts Department,121862.0,Hispanic/Latino,Full Time,Female,2006-06-12,2012-10-13
1,LIBRARY ASSISTANT,Library,26125.0,Hispanic/Latino,Full Time,Female,2000-07-19,2010-09-18
2,POLICE OFFICER,Houston Police Department-HPD,45279.0,White,Full Time,Male,2015-02-03,2015-02-03
3,ENGINEER/OPERATOR,Houston Fire Department (HFD),63166.0,White,Full Time,Male,1982-02-08,1991-05-25
4,ELECTRICIAN,General Services Department,56347.0,White,Full Time,Male,1989-06-19,1994-10-22

In [118]:
emp.groupby(['DEPARTMENT','GENDER']).agg({'BASE_SALARY' : 'mean'}).head(4)

                                    BASE_SALARY
DEPARTMENT                 GENDER
Admn. & Regulatory Affairs Female  48758.181818
                           Male    57592.285714
City Controller's Office   Female  58979.500000
                           Male    42640.000000

In [123]:
emp.pivot_table(index = ['DEPARTMENT', 'GENDER'], values = 'BASE_SALARY', aggfunc = 'mean').round(-3).head(4)

                                   BASE_SALARY
DEPARTMENT                 GENDER
Admn. & Regulatory Affairs Female      49000.0
                           Male        58000.0
City Controller's Office   Female      59000.0
                           Male        43000.0

In [125]:
emp.pivot_table(index ='DEPARTMENT' , columns = 'GENDER', values = 'BASE_SALARY', aggfunc = 'mean').round(-3).head(4)

GENDER                         Female     Male
DEPARTMENT
Admn. & Regulatory Affairs    49000.0  58000.0
City Controller's Office      59000.0  43000.0
City Council                  59000.0  58000.0
Convention and Entertainment  38000.0      NaN

In [126]:
pd.crosstab(index = emp['DEPARTMENT'] , columns = emp['RACE'], values = emp['BASE_SALARY'], aggfunc = 'mean').round(-3).head(4)

RACE,American Indian or Alaskan Native,Asian/Pacific Islander,Black or African American,Hispanic/Latino,Others,White
DEPARTMENT,,,,,,
Admn. & Regulatory Affairs,NaN,72000.0,46000.0,36000.0,NaN,77000.0
City Controller's Office,NaN,59000.0,52000.0,64000.0,NaN,NaN
City Council,NaN,NaN,77000.0,36000.0,NaN,64000.0
Convention and Entertainment,NaN,NaN,NaN,38000.0,NaN,NaN

In [127]:
#Crosstab can help if we want to express the metrics in percentage by using normalize keyword:
pd.crosstab(index=emp['GENDER'], columns=emp['RACE'], 
                normalize='all').round(3)

RACE,American Indian or Alaskan Native,Asian/Pacific Islander,Black or African American,Hispanic/Latino,Others,White
GENDER,,,,,,
Female,0.003,0.015,0.155,0.071,0.001,0.055
Male,0.003,0.039,0.201,0.174,0.001,0.283